그룹 정보는 배열이 아닌 형태로 존재하기도 한다.

In [1]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                     index=['joe','steve','wes','jim','travis'])

In [2]:
people

               a         b         c         d         e
joe     0.696754 -0.217959  0.009207 -0.195075  0.439326
steve  -0.354074  0.642227  0.774819 -1.443501 -0.314920
wes    -0.045163 -0.802970 -0.453494  0.563461 -0.598983
jim    -1.815166 -0.404243 -0.424804 -0.002246  1.257021
travis -0.657237  0.000973  0.144937  0.662506 -1.227495

In [3]:
people.ix[2:3, ['b','c']]

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

           b         c
wes -0.80297 -0.453494

In [25]:
people.iloc[2:3][['b','c']]

           b         c
wes -0.80297 -0.453494

In [28]:
people.ix[2:3, ['b','c']] = np.NAN

In [29]:
people

               a         b         c         d         e
joe     0.696754 -0.217959  0.009207 -0.195075  0.439326
steve  -0.354074  0.642227  0.774819 -1.443501 -0.314920
wes    -0.045163       NaN       NaN  0.563461 -0.598983
jim    -1.815166 -0.404243 -0.424804 -0.002246  1.257021
travis -0.657237  0.000973  0.144937  0.662506 -1.227495

In [30]:
mapping = {'a':'red',
          'b':'red',
          'c':'blue',
          'd':'blue',
          'e':'red',
          'f':'orange'}

In [31]:
by_column = people.groupby(mapping, axis=1)

In [33]:
by_column.sum()

            blue       red
joe    -0.185868  0.918121
steve  -0.668682 -0.026768
wes     0.563461 -0.644146
jim    -0.427050 -0.962389
travis  0.807442 -1.883759

In [34]:
people.groupby(mapping, axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3